0xsmirk/mcu_cmsis_svd/NXP/LPC1102_4_v4.svd
<?xml version="1.0" encoding="utf-8"?> 
<!--
	Software that is described herein is for illustrative purposes only
	which provides customers with programming information regarding the
	products. This software is supplied "AS IS" without any warranties.
	NXP Semiconductors assumes no responsibility or liability for the
	use of the software, conveys no license or title under any patent,
	copyright, or mask work right to the product. NXP Semiconductors
	reserves the right to make changes in the software without
	notification. NXP Semiconductors also make no representation or
	warranty that such application will be suitable for the specified
	use without further testing or modification.	
	
-->	
<device schemaVersion="1.1" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="CMSIS-SVD_Schema_1_1.xsd" >
  <name>LPC1102_04</name>
  <version>4</version>
  <description>LPC1102/04</description>
  <!-- Bus Interface Properties -->
  <!-- Cortex-M0 is byte addressable -->
	<cpu>
		<name>CM0</name>
		<revision>r0p0</revision>
		<endian>little</endian>
		<mpuPresent>0</mpuPresent>
		<fpuPresent>0</fpuPresent>
		<nvicPrioBits>2</nvicPrioBits>
		<vendorSystickConfig>0</vendorSystickConfig>
	</cpu>	
	
	<headerDefinitionsPrefix>LPC_</headerDefinitionsPrefix> 
  <addressUnitBits>8</addressUnitBits>
  <width>32</width>
	<size>32</size>
  <peripherals>
  	<peripheral>
  		<name>WWDT</name>
  		<description>Windowed WatchDog Timer (WDT) </description>
  		<groupName>WWDT</groupName>
  		<baseAddress>0x40004000</baseAddress>
  		<addressBlock>
  			<offset>0x0</offset>
  			<size>0xFFF</size>
  			<usage>registers</usage>
  		</addressBlock>
  		<interrupt>
  			<name>WDT</name>
  			<value>25</value>
  		</interrupt>
  		<registers>
  			<register>
  				<name>WDMOD</name>
  				<description>Watchdog mode register. This register contains the basic mode and status of the Watchdog Timer.</description>
  				<addressOffset>0x000</addressOffset>
  				<access>read-write</access>
  				<resetValue>0</resetValue>
  				<resetMask>0xFFFFFFFF</resetMask>
  				<fields>
  					<field>
  						<name>WDEN</name>
  						<description>Watchdog enable bit. This bit is Set Only. Setting this bit to one also locks the watchdog clock source. Once the watchdog timer is enabled, the watchdog timer clock source cannot be changed. If the watchdog timer is needed in Deep-sleep mode, the watchdog clock source must be changed to the watchdog oscillator before setting this bit to one.</description>
  						<bitRange>[0:0]</bitRange>
  						<enumeratedValues>
  							<name>ENUM</name>
  							<enumeratedValue>
  								<name>STOPPED</name>
  								<description>The watchdog timer is stopped.</description>
  								<value>0</value>
  							</enumeratedValue>
  							<enumeratedValue>
  								<name>RUN</name>
  								<description>The watchdog timer is running.</description>
  								<value>1</value>
  							</enumeratedValue>
  						</enumeratedValues>
  					</field>
  					<field>
  						<name>WDRESET</name>
  						<description>Watchdog reset enable bit. This bit is Set Only.</description>
  						<bitRange>[1:1]</bitRange>
  						<enumeratedValues>
  							<name>ENUM</name>
  							<enumeratedValue>
  								<name>NORESET</name>
  								<description>A watchdog timeout will not cause a chip reset.</description>
  								<value>0</value>
  							</enumeratedValue>
  							<enumeratedValue>
  								<name>RESET</name>
  								<description>A watchdog timeout will cause a chip reset.</description>
  								<value>1</value>
  							</enumeratedValue>
  						</enumeratedValues>
  					</field>
  					<field>
  						<name>WDTOF</name>
  						<description>Watchdog time-out flag. Set when the watchdog timer times out, by a feed error, or by events associated with WDPROTECT, cleared by software. Causes a chip reset if WDRESET = 1.</description>
  						<bitRange>[2:2]</bitRange>
  						
  					</field>
  					<field>
  						<name>WDINT</name>
  						<description>Watchdog interrupt flag. Set when the timer reaches the value in WDWARNINT. Cleared by software.</description>
  						<bitRange>[3:3]</bitRange>
  						
  					</field>
  					<field>
  						<name>WDPROTECT</name>
  						<description>Watchdog update mode. This bit is Set Only.</description>
  						<bitRange>[4:4]</bitRange>
  						<enumeratedValues>
  							<name>ENUM</name>
  							<enumeratedValue>
  								<name>ANYTIME</name>
  								<description>The watchdog reload value (WDTC) can be changed at any time.</description>
  								<value>0</value>
  							</enumeratedValue>
  							<enumeratedValue>
  								<name>LOWCOUNTER</name>
  								<description>The watchdog reload value (WDTC) can be changed only after the counter is below the value of WDWARNINT and WDWINDOW. Note: this mode is intended for use only when WDRESET =1.</description>
  								<value>1</value>
  							</enumeratedValue>
  						</enumeratedValues>
  					</field>
  					<field>
  						<name>RESERVED</name>
  						<description>Reserved. Read value is undefined, only zero should be written.</description>
  						<bitRange>[31:5]</bitRange>
  						
  					</field>
  				</fields>
  			</register>
  			<register>
  				<name>WDTC</name>
  				<description>Watchdog timer constant register. This register determines the time-out value.</description>
  				<addressOffset>0x004</addressOffset>
  				<access>read-write</access>
  				<resetValue>0xFF</resetValue>
  				<resetMask>0xFFFFFFFF</resetMask>
  				<fields>
  					<field>
  						<name>Count</name>
  						<description>Watchdog time-out interval.</description>
  						<bitRange>[23:0]</bitRange>
  					</field>
  					<field>
  						<name>RESERVED</name>
  						<description>Reserved. Read value is undefined, only zero should be written.</description>
  						<bitRange>[31:24]</bitRange>
  					</field>
  				</fields>
  			</register>
  			<register>
  				<name>WDFEED</name>
  				<description>Watchdog feed sequence register. Writing 0xAA followed by 0x55 to this register reloads the Watchdog timer with the value contained in WDTC.</description>
  				<addressOffset>0x008</addressOffset>
  				<access>write-only</access>
  				<resetValue>0</resetValue>
  				<resetMask>0x00000000</resetMask>
  				<fields>
  					<field>
  						<name>Feed</name>
  						<description>Feed value should be 0xAA followed by 0x55.</description>
  						<bitRange>[7:0]</bitRange>
  					</field>
  					<field>
  						<name>RESERVED</name>
  						<description>Reserved</description>
  						<bitRange>[31:8]</bitRange>
  					</field>
  				</fields>
  			</register>
  			<register>
  				<name>WDTV</name>
  				<description>Watchdog timer value register. This register reads out the current value of the Watchdog timer.</description>
  				<addressOffset>0x00C</addressOffset>
  				<access>read-only</access>
  				<resetValue>0xFF</resetValue>
  				<resetMask>0xFFFFFFFF</resetMask>
  				<fields>
  					<field>
  						<name>Count</name>
  						<description>Counter timer value.</description>
  						<bitRange>[23:0]</bitRange>
  					</field>
  					<field>
  						<name>RESERVED</name>
  						<description>Reserved. Read value is undefined, only zero should be written.</description>
  						<bitRange>[31:24]</bitRange>
  					</field>
  				</fields>
  			</register>
  			<register>
  				<name>WDWARNINT</name>
  				<description>Watchdog Warning Interrupt compare value.</description>
  				<addressOffset>0x014</addressOffset>
  				<access>read-write</access>
  				<resetValue>0</resetValue>
  				<resetMask>0xFFFFFFFF</resetMask>
  				<fields>
  					<field>
  						<name>WARNINT</name>
  						<description>Watchdog warning interrupt compare value.</description>
  						<bitRange>[9:0]</bitRange>
  					</field>
  					<field>
  						<name>RESERVED</name>
  						<description>Reserved. Read value is undefined, only zero should be written.</description>
  						<bitRange>[31:10]</bitRange>
  					</field>
  				</fields>
  			</register>
  			<register>
  				<name>WDWINDOW</name>
  				<description>Watchdog Window compare value.</description>
  				<addressOffset>0x018</addressOffset>
  				<access>read-write</access>
  				<resetValue>0xFFFFFF</resetValue>
  				<resetMask>0xFFFFFFFF</resetMask>
  				<fields>
  					<field>
  						<name>WINDOW</name>
  						<description>Watchdog window value.</description>
  						<bitRange>[23:0]</bitRange>
  					</field>
  					<field>
  						<name>RESERVED</name>
  						<description>Reserved. Read value is undefined, only zero should be written.</description>
  						<bitRange>[31:24]</bitRange>
  					</field>
  				</fields>
  			</register>
